---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TextNoteOptions
source: html/e572d32f-27a7-cbea-fe88-ec02b920e565.htm
---
# TextNoteOptions Members

Default constructor; populates the options with their respective default values.